---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.LayoutRule
source: html/2c5c4b92-7824-f8d0-351a-62615966ecaf.htm
---
# LayoutRule Members

Causes the object to release immediately any resources it may be utilizing.